Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnPanel
You can't change the connection type to Breakers connect to panel  [Panel Name] because there aren't enough slots. \nYou can increase the maximum number of breaker slots to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnPanel
You can't connect to panel [Panel Name] because there aren't enough slots and Feed Through Lugs is occupied. \nYou can increase the maximum number of breaker slots to be greater than [Number] to connect through breaker slots or you can disconnect existing Feed Through Lugs connection.